data/macrobench/isa_l_rs_vand/10/stdout.txt
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 172.16.0.34 (be patient)


Server Software:        Apache-Coyote/1.1
Server Hostname:        172.16.0.34
Server Port:            3000

Document Path:          /
Document Length:        204 bytes

Concurrency Level:      8
Time taken for tests:   196.064 seconds
Complete requests:      1000
Failed requests:        0
Non-2xx responses:      1000
Total transferred:      371000 bytes
Total body sent:        4194439000
HTML transferred:       204000 bytes
Requests per second:    5.10 [#/sec] (mean)
Time per request:       1568.513 [ms] (mean)
Time per request:       196.064 [ms] (mean, across all concurrent requests)
Transfer rate:          1.85 [Kbytes/sec] received
                        20891.79 kb/s sent
                        20893.64 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   57 107.3      2    1007
Processing:    91 1506 609.3   2055    3206
Waiting:       55 1463 602.2   2020    3169
Total:         93 1562 670.5   2056    4177

Percentage of the requests served within a certain time (ms)
  50%   2056
  66%   2105
  75%   2154
  80%   2186
  90%   2260
  95%   2310
  98%   2561
  99%   2937
 100%   4177 (longest request)